#ifndef __cabinet_h__
#define __cabinet_h__

#include <windows.h>
#include <string>
#include "CChain.h"
#include <gl/gl.h>
#include <gl/glu.h>

using namespace std;
/*
CCabinet类抽象了柜子链模型
提供了查询柜子门数,开柜子门等功能接口
提供了绘制功能和捡取功能以实现交互式工作
*/

struct SCab {
	int num;       //柜子的地址
	int count;      //柜子的柜门个数
	int state;      //柜子各柜门的状态
	
	SCab( int _num = 0, int _count = 0, int _state = 0 );
};

class CCabinet {
	private:
		HANDLE			commport;				//所有柜门模型都要通过同一个串口控制
		CChain<SCab>	cabs;					//柜子链
	public:
		//画布参数 
		long			x;
		long			y;
		long			width;
		long			height; 
	public:

		/*CCabinet构造函数创建一个柜子链模型
		########################################################################################
		参数:
		========================================================================================
		返回值:
		*/
		CCabinet( );
		
		/*析构函数释放所有资源
		*/ 
		~CCabinet( );
		
		/*OpenComm打开串口
		########################################################################################
		参数:
			string name							串口号码
			------------------------------------------------------------------------------------
			DWORD baudrate						波特率
		======================================================================================== 
		返回值:
			bool								成功则返回true
												失败返回false 
		*/ 
		bool OpenComm( string name, DWORD baudrate );
		
		/*CloseComm关闭串口 
		########################################################################################
		参数:
		========================================================================================
		返回值:
			bool								关闭是否成功
		*/ 
		bool CloseComm( void );
		
		/*IsCommOpen函数返回串口是否已经打开的信息
		########################################################################################
		*/
		bool IsCommOpen( void );

		/*GetGateCount函数返回当前模型中柜门个数
		########################################################################################
		参数:
			int									指定柜子号码
												号码不能为0 
		========================================================================================
		返回值:
			int                                 柜门个数
		*/
		int GetGateCount( int cabnum );
		
		/*GetGateState函数返回当前模型中柜门个数
		########################################################################################
		参数:
			int									指定柜子号码
												号码不能为0 
		========================================================================================
		返回值:
			int                                 柜门状态 
		*/
		int GetGateState( int cabnum );

		/*QueryCount函数向下位机查询柜子的信息
		########################################################################################
		参数:
			int									指定柜子号码
												若号码为0则表示查询所有柜子的信息
		========================================================================================
		返回值:
			bool								查询是否成功
												若查询成功,则参数已经被存入了模型中 
		*/
		bool QueryInfo( int cabnum = 0 );
		
		/*SetGateCount函数用来设置下位机柜门个数 
		########################################################################################
		参数:
			int cabnum							柜子编号 不能为0 
			------------------------------------------------------------------------------------ 
			int gatecount						柜门个数 
		*/
		bool SetGateCount( int cabnum, int gatecount );
		
		/*OpenGate函数打开指定柜子的指定柜门
		########################################################################################
		参数:
			int cabnum							柜子编号
			------------------------------------------------------------------------------------
			int gatenum							门编号
		========================================================================================
		返回值:
			bool								开门是否成功
		*/
		bool OpenGate( int cabnum, int gatenum );
		
		/*DrawCab函数绘制柜子模型
		########################################################################################
		参数:
			int cabnum							绘制的柜子的编号
		========================================================================================
		返回值:
		========================================================================================
		注意:
			绘制使用窗口坐标系,即原点在窗口左上角,x轴从左向右,y轴从上到下 
			被鼠标关注的柜门会被特殊绘制 
		*/
		void DrawCab( int cabnum );
		
		/*CatchGate函数通过鼠标相对于窗口的坐标抓取一个柜门
		########################################################################################
		参数:
			int cabnum							要抓取的柜子号码
			------------------------------------------------------------------------------------
			POINTS pos							鼠标相对于窗口的坐标 
		======================================================================================== 
		返回值:
			int									柜门号码,若返回值为0则表示没有检索到任何柜门
		*/
		int	CatchGate( int cabnum, POINTS pos );
};

#endif

